Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: Basically you will need to use the latter when doing inter-thread communication; when you use only the main thread you can also safely use the former.
ja: 基本的に、スレッド間通信を行なう場合は後者を選択する必要があります; メインスレッドのみを使用する場合は前者も安全に使用することができます。

source: Basically, there are only a few things to watch out for:
ja: 基本的には、気をつけなければならないことはごく僅かです。

source: Basically, you can remove them from any code which used them.
ja: 基本的にはどのコードからも取り除くことができます。

source: Because adaptation rearranges your sizer and window hierarchy, it is not fool-proof, and may fail in the following situations:
ja: 適応はサイザーとウィンドウの階層構造を変更するため、これは確実に行えるものではなく、以下のような状況では適応に失敗します:

source: Because all frames must be destroyed for the application to exit, it is advisable to use parent frames wherever possible when creating new frames, so that deleting the top level frame will automatically delete child frames.
ja: アプリケーションを終了するためにはすべてのフレームを破棄しなければならないため、可能な限り、新しいフレームを作成するときは親フレームを使用するようにするべきです。こうすることで、トップレベルフレームの削除時に自動的に子フレームが削除されます。

source: Because of the need to support implicit conversions to both char and wchar_t, wxString implementation is rather involved and many of its operators don't return the types which they could be naively expected to return.
ja: char と wchar_t の暗黙的な相互変換をサポートする必要があるため、 wxString の実装はかなり複雑で、演算子の多くは (返却されるものと) 単純に予想される型を実際には返却しません。

source: Because of this you should only use wxString::From8BitData() for the strings created using wxString::To8BitData().
ja: このため、wxString::From8BitData() は wxString::To8BitData() によって作られた文字列に対してのみ、使用するべきです。

source: Because of this, code like the following
ja: このため、次のようなコードは

source: Because of this, you cannot pass its result to any standard vararg functions such as printf() any more as described in Unicode-Related Compilation Errors.
ja: このため、Unicode 関連のコンパイルエラー で説明している通り、この戻り値を printf() といった標準の可変引数関数に渡すことはもはやできません。

source: Before anything else happens, wxApp::FilterEvent() is called.
ja: 他の処理を行う前に wxApp::FilterEvent() を呼び出します。

source: Before showing how this can be useful, let us explain what log components are: they are simply arbitrary strings identifying the component, or module, which generated the message.
ja: これがどれほど役立つか説明する前に、ログコンポーネントについて説明しましょう: ログコンポーネントとは単純に、メッセージを生成するコンポーネントやモジュールを識別する任意の文字列のことです。

source: Before starting an MT application (or starting to add MT features to an existing one) it is worth asking oneself if there is no easier and safer way to implement the same functionality.
ja: マルチスレッドアプリケーションの開発を始める前に (もしくは既存のアプリケーションにマルチスレッド機能を追加する前に)、同じ機能を実装するためのより簡単で安全な方法がないか自問するだけの価値はあります。

source: Before version 2.0 of wxWidgets, events were handled by the application either by supplying callback functions, or by overriding virtual member functions such as OnSize.
ja: wxWidgets 2.0 より前のバージョンでは、イベント処理はコールバック関数か、OnSize といった仮想メンバ関数のオーバーライドで実現されていました。

source: Beware that even if NUL character is allowed, in the current string implementation some methods might not work correctly with them.
ja: NUL 文字も格納できるとは言え、現在の実装ではいくつかの関数が NUL 文字を含む場合にうまく動作しないことに注意してください。

source: Bind(MY_EVENT, &MyFrame::OnMyEvent, this, ID_MY_WINDOW); } // example of code generating the event void MyWindow::SendEvent() {
ja: Bind(MY_EVENT, &MyFrame::OnMyEvent, this, ID_MY_WINDOW); } // イベントを生成するコードの例 void MyWindow::SendEvent() {

source: Binds the given function, functor or method dynamically with the event.
ja: 指定された関数、ファンクタ、メンバ関数をイベントへ動的にバインドします。

source: Bitmap Format Handlers
ja: ビットマップ形式ハンドラ

source: Bitmap handlers are not implemented on all platforms, and new ones rarely need to be implemented since wxImage can be used for loading most formats, as noted earlier.
ja: ビットマップハンドラはすべてのプラットフォームで実装されているわけでありませんし、新しいものを実装する必要もほとんどないでしょう。なぜなら、前で述べたように wxImage を使用することで大半の形式を読み込むことができるためです。

source: Bitmaps and Icons
ja: ビットマップとアイコン

source: Both strategies are described in details below.
ja: 両方の戦略について、以下で詳細に述べています。

source: Both the client and the server use an instance of this class, one per connection.
ja: クライアントとサーバの両方とも、このクラスのインスタンスをコネクションごとにひとつ使用します。

source: But MyApp object is deleted after wxWidgets structures that wxCHMHelpController depends on were uninitialized!
ja: しかし、MyApp オブジェクトは wxCHMHelpController の依存する wxWidgets 構造が未初期化状態になった後に削除されます。

source: But although by default only the command events are propagated like this, other events can be propagated as well because the event handling code uses wxEvent::ShouldPropagate() to check whether an event should be propagated.
ja: しかし、コマンドイベントがデフォルトで伝播するとはいえ、他のイベントも伝播させることは可能です。なぜなら、イベント処理コードではwxEvent::ShouldPropagate() を用いてイベントを伝播させるかどうかを確認するためです。

source: But calling a frame method with the child window pointer instead of the pointer to the frame is, of course, disastrous.
ja: しかし、当然のことながら、フレームのポインタの代わりに子ウィンドウのポインタに対してフレームのメンバ関数を呼ぶと悲惨なことになります。

source: But even if it does exist at wxWidgets level, it should never be called directly as the event handlers are not part of wxWidgets API and should never be called directly.
ja: たとえ wxWidgets の階層に存在したとしても、イベントハンドラは wxWidgets API の一部ではないため、直接呼ぶべきではありません。

source: But if you do use them, it is better to use wchar_t pointers rather than char ones to avoid the data loss problems due to conversion as discussed in the previous section.
ja: それでもポインタを使用する場合、前のセクションで述べたような変換に伴うデータ喪失の問題を避けるために char ポインタよりも wchar_t ポインタを使うようにした方が良いです。

source: But in all cases wxWidgets represents these events in a uniform way and allows you to handle them in the same way wherever they originate from.
ja: しかし、すべての場合において、wxWidgets ではそれらのイベントを同じ形式で表現しており、イベントの派生元によらず、同一の方法で処理することができます。

source: But it hasn't happened yet, and the migration towards Unicode has created new challenges, resulting in "compatibility encodings" such as UTF-8.
ja: しかし、これまでには存在しなかった、Unicode への移行という新たな課題が生じました。その結果、UTF-8 などの "互換エンコーディング" が考案されました。

source: But keep in mind that then the lifetime of myFrameHandler must be greater than that of MyFrame object -- or at least it needs to be unbound before being destroyed.
ja: ただし、myFrameHandler の寿命を MyFrame よりも長くなるようにするか、もしくは少なくとも破棄される前にバインディングを解除する必要があることを覚えておいてください。

source: But note that no additional libraries are needed during run-time, however, so you have only the message catalogs to distribute and nothing else.
ja: しかし、実行時には追加のライブラリは必要ないため、メッセージカタログの他には何も配布する必要がないことに注意してください。

source: But often, your environment doesn't want Unicode strings.
ja: しかし、Unicode 文字列を使用できない環境もよくあります。

source: But this absolutely doesn't mean that using the event tables is the preferred way: handling events dynamically is better in several aspects and you should strongly consider doing it if you are just starting with wxWidgets.
ja: ただし、これはイベントテーブルが適切な方法であることを意味しているわけではまったくありません: ある側面においては動的なイベント処理の方が優れており、wxWidgets を使い始める際には動的にイベント処理を行なうことを強く検討するべきです。

source: But, once again, none of these cryptic types is really needed if you just pass the return value of any of the functions mentioned in this section to another function directly.
ja: しかし、実際には上記の関数の戻り値を別の関数へ直接渡すだけで、この謎めいた型を使用する必要がなくなります。

source: By convention, you should only use characters without diacritics (i.e. 7-bit ASCII strings) for msgids in the source code and write them in English.
ja: ソースコード中の msgid には発音区別符号を含まない文字 (つまり、7 ビット ASCII 文字列) だけを使用するべきで、それらは英語で書いてください。

source: By default the chain is empty, i.e. there is no next handler.
ja: デフォルトでは連鎖は空、つまり、次のイベントハンドラは存在しません。

source: By default this adaptation is off.
ja: デフォルトではこの適応は無効になっています。

source: By default, wxUSE_UNICODE_WCHAR is also defined as 1, however in UTF-8 build (described in the previous section), it is set to 0 and wxUSE_UNICODE_UTF8, which is usually 0, is set to 1 instead.
ja: デフォルトでは wxUSE_UNICODE_WCHAR も 1 に定義されていますが、(前の章で述べた) UTF-8 ビルドでは 0 に設定されており、通常は 0 に設定されている wxUSE_UNICODE_UTF8 が代わりに 1 に設定されています。

source: By default, GetEventHandler returns a pointer to the window itself unless an application has redirected event handling using SetEventHandler or PushEventHandler.
ja: SetEventHandler や PushEventHandler を使用してイベント処理をリダイレクトしていない場合、デフォルトでは GetEventHandler はウィンドウ自身を返却します。

source: By default, all messages logged by wxWidgets originate from "wx" component or one of its subcomponents such as "wx/net/ftp", while the messages logged by your own code are assigned empty log component.
ja: デフォルトでは wxWidgets によって記録されるすべてのメッセージは "wx" コンポーネントかそのサブコンポーネント ("wx/net/ftp" など) に割り当てられており、あなた自身のコードによって記録されるメッセージは空のログコンポーネントに割り当てられています。

source: By default, all the steps described above will be performed but by setting the level to 1, for example, you can choose to only look for wxStdDialogButtonSizer.
ja: デフォルトでは上で述べた処理がすべて行われますが、レベルを 1 に設定することで wxStdDialogButtonSizer のみを探すようにできます。

source: By default, it points to wxConvLibc or wxConvLocal, depending on which works best on the current platform.
ja: デフォルトでは wxConvLibc と wxConvLocal のうち、現在のプラットフォームに適している方が使用されます。

source: By default, most log messages are enabled.
ja: デフォルトでは大半のログメッセージが有効化されています。

source: By default, the DDE implementation is used under Windows.
ja: Windows ではデフォルトで DDE 版が使用されます。

source: Call wxWindow::Destroy if you want to be certain that the window is destroyed.
ja: 確実にウィンドウを破棄する場合、wxWindow::Destroy を呼び出してください。

source: Call this from your event handler to veto a system shutdown or to signal to the calling application t...
ja: システムシャットダウンを拒否したり、ウィンドウを終了しないことを呼び出し元へ通知したりするためにイベントハンドラ内でこの関数を呼び出してください。

source: Call this function to tell wxScrolled to perform the actual scrolling on a different window (and not ...
ja: 異なるウィンドウ (同じウィンドウではありません) 上の wxScrolled を実際にスクロールさせるためにはこの関数を呼び出してください。

source: Call this to force layout of the children anew, e.g.
ja: 強制的に子コントロールの再配置するときにこの関数を呼んでください。

source: Called after OnDrop() returns true.
ja: OnDrop() のあとに呼び出すと true を返却します。

source: Called by MakeConnection(), by default this simply returns a new wxConnection object.
ja: MakeConnection() から呼ばれ、デフォルトでは単純に新しい wxConnection オブジェクトを返却するだけです。

source: Called to log a new record.
ja: 新しいレコードを記録するために呼ばれます。

source: Called to log the specified string at given level.
ja: 指定されたレベルで与えられた文字列を記録するために呼ばれます。

source: Called to log the specified string.
ja: 指定された文字列を記録するために呼ばれます。

source: Calling wxClient::MakeConnection implicitly creates an instance of MyConnection if the request for a connection is accepted, and the client then requests an Advise loop from the server (an Advise loop is where the server calls the client when data has changed).
ja: wxClient::MakeConnection を呼び出すと接続要求が受け付けられた場合に MyConnection のインスタンスが暗黙的に作成されます。そして、クライアントはサーバからの Advise ループを要求します。(Advise ループとはデータが変更されたときにサーバがクライアントを呼び出すところのことです)

source: Calling this method immediately repaints the invalidated area of the window and all of its children r...
ja: この関数を呼び出すと直ちにウィンドウとその子コントロールの無効領域を再帰的に再描画します。(通常、これは制御フローがイベントループに戻ってきたときにだけ行われます)

source: Calling this provides useful information to the calling code.
ja: この関数を呼ぶことで呼び出し元へ有用な情報を提供します。

source: Calling wxConfig::Write() with an enum value will fail to compile because wxConfig now tries to convert all unknown types to wxString automatically using wxToString() function.
ja: wxConfig は wxToString() を使用して不明な型を自動的に wxString へ変換するようになったため、wxConfig::Write() に enum 値を渡すとコンパイルに失敗します。

source: Calls wxFileTranslationsLoader::AddCatalogLookupPathPrefix().
ja: wxFileTranslationsLoader::AddCatalogLookupPathPrefix() を呼び出します。

source: Calls wxTranslations::AddCatalog(const wxString&).
ja: wxTranslations::AddCatalog(const wxString&) を呼び出します。

source: Categories
ja: カテゴリ

source: Caveats When Not Using C++ RTTI
ja: C++ RTTI を使用しない場合の注意点

source: Changes Since wxWidgets 2.8
ja: wxWidgets 2.8 からの変更点

source: Changes the selection for the given page, returning the previous selection.
ja: 指定されたページを変更し、以前選択していたページを返却します。

source: Character type (char or wchar_t)
ja: 文字型 (char または wchar_t)

source: Child windows are deleted from within the parent destructor.
ja: 子ウィンドウは親ウィンドウのデストラクタで削除されます。

source: Choosing Unicode Representation
ja: Unicode 表現の選択

source: Classes
ja: クラス

source: Classes for reading text or binary data from a particular stream such as wxTextInputStream, wxTextOutputStream, wxDataInputStream and wxDataOutputStream
ja: 特定のストリームからテキストデータやバイナリデータを読み込むクラス: wxTextInputStream, wxTextOutputStream, wxDataInputStream, wxDataOutputStream

source: Classes:
ja: クラス:

source: Classes: wxApp
ja: クラス: wxApp

source: Classes: wxBitmap, wxBitmapHandler, wxIcon, wxCursor.
ja: クラス: wxBitmap, wxBitmapHandler, wxIcon, wxCursor.

source: Classes: wxBufferedDC, wxBufferedPaintDC, wxDC, wxPostScriptDC, wxMetafileDC, wxMemoryDC, wxPrinterDC, wxScreenDC, wxClientDC, wxPaintDC, wxWindowDC.
ja: クラス: wxBufferedDC, wxBufferedPaintDC, wxDC, wxPostScriptDC, wxMetafileDC, wxMemoryDC, wxPrinterDC, wxScreenDC, wxClientDC, wxPaintDC, wxWindowDC.

source: Classes: wxCloseEvent, wxWindow
ja: クラス: wxCloseEvent, wxWindow

source: Classes: wxConfig
ja: クラス: wxConfig

source: Classes: wxConfigBase
ja: クラス: wxConfigBase

source: Classes: wxDataObject, wxTextDataObject, wxDropSource, wxDropTarget, wxTextDropTarget, wxFileDropTarget
ja: クラス: wxDataObject, wxTextDataObject, wxDropSource, wxDropTarget, wxTextDropTarget, wxFileDropTarget

source: Classes: wxDialog
ja: クラス: wxDialog

source: Classes: wxDialog, wxDialogLayoutAdapter
ja: クラス: wxDialog, wxDialogLayoutAdapter

source: Classes: wxEvtHandler, wxWindow, wxEvent
ja: クラス: wxEvtHandler, wxWindow, wxEvent

source: Classes: wxFile, wxDir, wxTempFile, wxTextFile
ja: クラス: wxFile, wxDir, wxTempFile, wxTextFile

source: Classes: wxListCtrl, wxImageList
ja: クラス: wxListCtrl, wxImageList

source: Classes: wxLog, wxLogStderr, wxLogStream, wxLogTextCtrl, wxLogWindow, wxLogGui, wxLogNull, wxLogBuffer, wxLogChain, wxLogInterposer, wxLogInterposerTemp, wxStreamToTextRedirector, wxLogFormatter
ja: クラス: wxLog, wxLogStderr, wxLogStream, wxLogTextCtrl, wxLogWindow, wxLogGui, wxLogNull, wxLogBuffer, wxLogChain, wxLogInterposer, wxLogInterposerTemp, wxStreamToTextRedirector, wxLogFormatter

source: Classes: wxLog,
ja: クラス: wxLog,

source: Classes: wxMBConv, wxMBConvLibc, wxMBConvUTF7, wxMBConvUTF8, wxCSConv, wxMBConvUTF16, wxMBConvUTF32
ja: クラス: wxMBConv, wxMBConvLibc, wxMBConvUTF7, wxMBConvUTF8, wxCSConv, wxMBConvUTF16, wxMBConvUTF32

source: Classes: wxServer, wxConnection, wxClient
ja: クラス: wxServer, wxConnection, wxClient

source: Classes: wxServer, wxConnection, wxClient wxWidgets has a number of different classes to help with interprocess communication and network programming.
ja: クラス: wxServer, wxConnection, wxClient wxWidgets にはプロセス間通信やネットワークプログラミングを支援する様々なクラスがあります。

source: Classes: wxSizer, wxBoxSizer, wxStaticBoxSizer, wxGridSizer, wxFlexGridSizer, wxGridBagSizer
ja: クラス: wxSizer, wxBoxSizer, wxStaticBoxSizer, wxGridSizer, wxFlexGridSizer, wxGridBagSizer

source: Classes: wxSizer, wxGridSizer, wxFlexGridSizer, wxBoxSizer, wxStaticBoxSizer, CreateButtonSizer
ja: クラス: wxSizer, wxGridSizer, wxFlexGridSizer, wxBoxSizer, wxStaticBoxSizer, CreateButtonSizer

source: Classes: wxStreamBase, wxStreamBuffer, wxInputStream, wxOutputStream, wxFilterInputStream, wxFilterOutputStream
ja: クラス: wxStreamBase, wxStreamBuffer, wxInputStream, wxOutputStream, wxFilterInputStream, wxFilterOutputStream

source: Classes: wxString, wxArrayString, wxStringTokenizer
ja: クラス: wxString, wxArrayString, wxStringTokenizer

source: Classes: wxThread, wxMutex, wxCriticalSection, wxCondition
ja: クラス: wxThread, wxMutex, wxCriticalSection, wxCondition

source: Classes: wxThread, wxThreadHelper, wxMutex, wxCriticalSection, wxCondition, wxSemaphore
ja: クラス: wxThread, wxThreadHelper, wxMutex, wxCriticalSection, wxCondition, wxSemaphore

source: Classes: wxValidator, wxTextValidator, wxGenericValidator
ja: クラス: wxValidator, wxTextValidator, wxGenericValidator

source: Classes: wxValidator, wxTextValidator, wxGenericValidator, wxIntegerValidator, wxFloatingPointValidator
ja: クラス: wxValidator, wxTextValidator, wxGenericValidator, wxIntegerValidator, wxFloatingPointValidator

source: Close can be vetoed by this process (return false), whereas Destroy definitely destroys the window.
ja: Close は (false を返却したときに) 終了処理を拒否できるのに対し、Destroy は確実にウィンドウを削除します。

source: Closing Windows
ja: ウィンドウの終了

source: Code points are represented in computer memory as a sequence of one or more code units, where a code unit is a unit of memory: 8, 16, or 32 bits.
ja: コードポイントはメモリ上ではひとつ以上の コード単位 の並びとして表現されます。コード単位とは 8、16、32 ビットといったメモリの単位のことです。

source: Common Features
ja: 共通の機能

source: Common features
ja: 共通の機能

source: Comparison to Other String Classes
ja: 他の文字列クラスとの比較

source: Compatible with wxWidgets 2.8:
ja: wxWidgets 2.8 互換:

source: Compiling the .po file into .mo file to be used by the program.
ja: .po ファイルをプログラムから使用される .mo ファイルにコンパイルする。

source: Consider using string iterators instead if possible or replace this expression with
ja: 可能であれば代わりに文字列のイテレータを使用するようにするか、次のように置き換えてください。

source: Construction of wxCSConv instance on the fly.
ja: 実行時における wxCSConv インスタンスの構築。

source: Constructor for a wxBoxSizer.
ja: wxBoxSizer のコンストラクタ。

source: Container for sizer items flags providing readable names for them.
ja: サイザーのフラグを格納するコンテナで、フラグに読みやすい名前を提供します。

source: Converting Buffers
ja: バッファの変換

source: Converting Data
ja: データの変換

source: Converting Strings
ja: 文字列の変換

source: Converting data
ja: データの変換

source: Converts C string encoded in UTF-8 to wxString.
ja: UTF-8 で符号化された C 文字列を UTF-8 に変換します。

source: Converts given buffer of binary data from 8-bit string to wxString.
ja: 与えられたバイナリデータを 8 ビット文字列から wxString に変換します。

source: Converts string to a wxColour best represented by the given string.
ja: 指定された文字列で表現される wxColour へ文字列を変換します。

source: Converts the given wxColour into a string.
ja: 指定された wxColour を文字列に変換します。

source: Converts the string to an 8-bit string in ISO-8859-1 encoding in the form of a wxCharBuffer (Unicode ...
ja: 文字列を ISO-8859-1 の 8 ビット文字列に変換し、wxCharBuffer として返却します。 (Unicode ビルド時のみ)

source: Converts the string to an ASCII, 7-bit string in the form of a wxCharBuffer (Unicode builds only) or ...
ja: wxCharBuffer (Unicode ビルドのみ) もしくは C 文字列 (ANSI ビルド) の形式で文字列を ASCII 7 ビット文字列に変換する。

source: Converts the strings contents to UTF-8 and returns it either as a temporary wxCharBuffer object or as...
ja: 文字列を UTF-8 に変換したものを一時的な wxWCharBuffer オブジェクト、または内部文字列のポインタ (UTF-8 ビルド時) として返却します。

source: Converts the strings contents to the wide character representation and returns it as a temporary wxWC...
ja: 文字列をワイド文字表現に変換したものを一時的な wxWCharBuffer オブジェクト (Unix と OS X の場合)、またはワイド文字列である内部文字列のポインタ (Windows の場合) として返却します。

source: Copies the current host machine's name into the supplied buffer.
ja: 現在のホストマシン名を与えられたバッファへコピーします。

source: Copy from a source DC to this DC.
ja: コピー元 DC からこの DC へコピーします。

source: Correspondingly, when using a horizontal sizer, each child can be centered, aligned at the bottom or aligned at the top.
ja: 同様に、水平方向のサイザーを使用する場合、各子コントロールを中央寄せ、下寄せ、上寄せにすることが可能です。

source: Create an instance of your client object.
ja: クライアントオブジェクトのインスタンスを作成する。

source: Create an instance of your server object and call Create to activate it, giving it a service name.
ja: サーバオブジェクトのインスタンスを作成し、作成したオブジェクトを有効化するためにサービス名を指定して Create を呼び出す。

source: Creates a sizer with standard buttons.
ja: 標準ボタンを含むサイザーを作成します。

source: Creates a wxLog class for the application to use for logging errors.
ja: エラーを記録するためにアプリケーション用の wxLog クラスを作成します。

source: Creates the wxAppTraits object when GetTraits() needs it for the first time.
ja: 最初に GetTraits() が必要とした時に wxAppTraits オブジェクトを作成します。

source: Custom Event Summary
ja: カスタムイベントの概要

source: Customising scrolling adaptation
ja: スクロールの適応のカスタマイズ

source: Cycles through the tabs.
ja: タブを循環させます。

source: DDE works within one computer only.
ja: DDE は同じコンピュータ内でのみ動作します。

source: DECLARE_EVENT_TYPE(wxEVT_MY_EVENT, -1) DEFINE_EVENT_TYPE(wxEVT_MY_EVENT) // user code intercepting the event BEGIN_EVENT_TABLE(MyFrame, wxFrame)
ja: DECLARE_EVENT_TYPE(wxEVT_MY_EVENT, -1) DEFINE_EVENT_TYPE(wxEVT_MY_EVENT) // イベントを捕まえるユーザコード BEGIN_EVENT_TABLE(MyFrame, wxFrame)

source: Data Loss due To Unicode Conversion Errors
ja: Unicode の変換エラーによるデータ喪失

source: Data Transfer
ja: データの転送

source: Declares a custom event type.
ja: カスタムイベント型を宣言します。

source: Default Window Close Behaviour
ja: ウィンドウ終了時のデフォルトの振る舞い

source: Default alignment is wxALIGN_LEFT | wxALIGN_TOP.
ja: デフォルトのアライメントは wxALIGN_LEFT | wxALIGN_TOP です。

source: Default location of wxFileConfig files has changed under Windows, you will need to update your code if you access these files directly.
ja: Windows における wxFileConfig ファイルのデフォルトの場所が変更されたため、これらのファイルに直接アクセスしている場合はコードを更新する必要があります。

source: Define a new event type associated with the specified event class.
ja: 特定のイベントクラスに関連する新しいイベント型を定義します。

source: Defining Your Own Event Class
ja: 独自のイベントクラスの定義

source: Defining your own event class
ja: 独自のイベントクラスの定義

source: Deletes all items in the control.
ja: コントロール内のすべての項目を削除します。

source: Deletes the specified item.
ja: 指定された項目を削除します。

source: Deletes the specified page, and the associated window.
ja: 指定されたページと、それに関連するウィンドウを削除します。

source: Depending on what flags are used for the respective dialog item, the dialog item can be made to fill out the available space entirely, i.e. it will grow to a size larger than the minimal size, or it will be moved to either the centre of the available space or to either side of the space.
ja: 個々のコントロールに使用されたフラグに応じて空きスペースを満たす、つまり、最小サイズ以上に伸長させるか、空きスペースの中央またはいずれかの側に移動させることができます。

source: Derive a class from wxClient, overriding OnMakeConnection to create and return an instance of the derived connection class.
ja: wxClient を継承して OnMakeConnection をオーバーライドし、継承したコネクションクラスのインスタンスを作成して返却する。

source: Derive a class from wxConnection, providing handlers for various messages sent to the client side of a wxConnection (e.g. OnAdvise).
ja: wxConnection を継承し、wxConnection のクライアント側へ送信されたメッセージ用のハンドラ (OnAdvise など) を用意する。

source: Derive a class from wxConnection, providing handlers for various messages sent to the server side of a wxConnection (e.g. OnExecute, OnRequest, OnPoke).
ja: wxConnection を継承し、wxConnection のサーバ側へ送信されたメッセージ用のハンドラ (OnExecute、OnRequest、OnPoke など) を用意する。

source: Derive a class from wxServer, overriding OnAcceptConnection to accept or reject a connection on the basis of the topic argument.
ja: wxServer を継承し、トピック引数に基づいて接続を許可または拒否するために OnAcceptConnection をオーバーライドする。

source: Derived classes include wxMBConvLibc, several different wxMBConvUTFxxx classes, and wxCSConv, which implement different kinds of conversions.
ja: 継承クラスには wxMBConvLibc、いくつかの wxMBConvUTFxxx クラス、wxCSConv が含まれており、それぞれ異なる種類の変換を行います。

source: Derived from
ja: 継承元

source: Destroys the window safely.
ja: 安全にウィンドウを破棄します。

source: Device Contexts
ja: デバイスコンテキスト

source: Directories
ja: ディレクトリ

source: Do child windows get deleted automatically?
ja: 子ウィンドウは自動的に削除されますか?

source: Documentation
ja: ドキュメント

source: Documented for information.
ja: 参考情報として文書化されています。

source: Doing it in a naive way doesn't work:
ja: これは単純な方法では実現できません:

source: Drag and Drop Overview
ja: ドラッグ・アンド・ドロップの概要

source: Due to limitations of the underlying physical storage, it may not implement 100% of the base class functionality.
ja: 根底にある物理ストレージの制約のため、基底クラスの機能を 100% 実装しているわけではありません。

source: During program development you will need the gettext package for working with message catalogs.
ja: プログラム開発を行なっている間はメッセージカタログを扱うために gettext パッケージが必要となります。

source: Dynamic Event Handling
ja: 動的イベント処理

source: EVT_CHAR, EVT_KEY_DOWN and EVT_KEY_UP macros handle keyboard input for any window.
ja: EVT_CHAR、EVT_KEY_DOWN、EVT_KEY_UP マクロは任意のウィンドウのキーボード入力を処理します。

source: Each entry contains either a string or a number (or a boolean value; support for other types of data such as dates or timestamps is planned) and is identified by the full path to it: something like /MyApp/UserPreferences/Colors/Foreground.
ja: 各エントリは文字列か数値 (もしくは真偽値; 日付やタイムスタンプなど、他の型にも対応する予定です) のいずれかを含み、それらは (/MyApp/UserPreferences/Colors/Foreground のような) フルパスで識別されます。
